// Задание 3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "rus");
    int n, min, num = 0; //объявляем переменные
    cout << "Введите размерность массива: " << endl;
    cin >> n;
    int* mass = new int[n]; //объявляем массив
    cout << "Введите элементы массива: " << endl;
    for (int i = 0; i < n; i++) //цикл для вывода массива
    {
        cout << "mass[" << i << "]= ";
        cin >> mass[i];
    }
    min = mass[0]; //присваем переменной min первый элемент массива
    for (int i = 0; i < n; i++) //цикл для поиска элемента в массиве
    {
        if (mass[i] <= min) //условие при котором найдется минимальный последний элемент массива
        {
            min = mass[i];
            num = i;
        }
    }
    cout << "Минимальный последний элемент = " << min << endl;
    cout << "Номер последнего минимального элемента = " << num << endl;
    system("pause");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
